#!/bin/bash

#*****************************************************************************************************************
#
# oYoインストール後、初回起動時のみ実行される処理
#
#*****************************************************************************************************************

#----------------------------------------------------------------------------------------------------------------
# calamaresインストーラーで選択したキーボードレイアウトを取得($LAYOUT)
#----------------------------------------------------------------------------------------------------------------
#localectl | 3行目を取得 | X11 Layout:を削除 | 空白除去
LAYOUT=$(localectl | sed -n 3p | sed -e "s/X11 Layout://g" | sed 's/^ *\| *$//')


#----------------------------------------------------------------------------------------------------------------
# main.confの「'xkb', 'XX'」を「'xkb', '$LAYOUT'」に書き換え
#----------------------------------------------------------------------------------------------------------------
cat /etc/dconf/db/local.d/main.conf | sed -e s/"'xkb', '.*'"/"'xkb', '$LAYOUT'"/g > hoge.txt
mv hoge.txt /etc/dconf/db/local.d/main.conf
dconf update

#----------------------------------------------------------------------------------------------------------------
# profileファイルの「Default Layout=」に「$LAYOUT」をセット
#----------------------------------------------------------------------------------------------------------------
cat /usr/share/openyellowos/profile | sed -e s/"Default Layout=.*"/"Default Layout=$LAYOUT"/g > hoge.txt
mv hoge.txt /usr/share/openyellowos/profile

#----------------------------------------------------------------------------------------------------------------
# profileファイルの「Name=keyboard-」に「$LAYOUT」をセット
#----------------------------------------------------------------------------------------------------------------
cat /usr/share/openyellowos/profile | sed -e s/"Name=keyboard-.*"/"Name=keyboard-$LAYOUT"/g > hoge.txt
mv hoge.txt /usr/share/openyellowos/profile

#----------------------------------------------------------------------------------------------------------------
#　インストール時に作成されるユーザーのhomeディレクトリのprofileファイルを
#　修正したファイルで上書き
#----------------------------------------------------------------------------------------------------------------
dir_path="/home/*"
#HOMEディレクトリ直下にあるディレクトリのパスを取得
dirs=`find $dir_path -maxdepth 0 -type d`

for dir in $dirs;
do
    #/home/[ユーザー名]からユーザー名を取得
    user=${dir:6}
    #skelディレクトリ配下を/home/[ユーザー名]にコピー
    cp /usr/share/openyellowos/profile $dir/.config/fcitx5/profile
     #所有者をユーザーに変更
    chown -R $user:$user $dir
done

#----------------------------------------------------------------------------------------------------------------
#skelディレクトリのprofileファイルを、修正したファイルで上書き
#----------------------------------------------------------------------------------------------------------------
cp /usr/share/openyellowos/profile /etc/skel/.config/fcitx5/profile

